In [5]:
import pandas as pd
import numpy as np

In [6]:
from pandas import ExcelWriter
from pandas import ExcelFile

In [54]:
df=pd.read_csv ('C:/Users/Shanty/Desktop/Python Start to End/sample.csv')

In [55]:
df.head()

   column1  column2  column3  column4  column5
0        1        2        3        4        5
1        6        7        8        9       10
2        2        3        4        5        6
3        4        5        6        7        8

In [56]:
df=pd.read_csv ('C:/Users/Shanty/Desktop/Python Start to End/test1.csv')

In [57]:
df.head()  # Selects 5 rows

,ID,X0,X1,X2,X3,X4,X5,X6,X8,X10,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,1,az,v,n,f,d,t,a,w,0,...,0,0,0,1,0,0,0,0,0,0
1,2,t,b,ai,a,d,b,g,y,0,...,0,0,1,0,0,0,0,0,0,0
2,3,az,v,as,f,d,a,j,j,0,...,0,0,0,1,0,0,0,0,0,0
3,4,az,l,n,f,d,z,l,n,0,...,0,0,0,1,0,0,0,0,0,0
4,5,w,s,as,c,d,y,i,m,0,...,1,0,0,0,0,0,0,0,0,0

In [58]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 377 entries, ID to X385
dtypes: int64(369), object(8)
memory usage: 12.1+ MB

In [59]:
df.describe()  #only takes numerical(object) columns into consideration and not categorical or alphabetic features

,ID,X10,X11,X12,X13,X14,X15,X16,X17,X18,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4211.039202,0.019007,0.000238,0.074364,0.061060,0.427893,0.000713,0.002613,0.008791,0.010216,...,0.325968,0.049656,0.311951,0.019244,0.011879,0.008078,0.008791,0.000475,0.000713,0.001663
std,2423.078926,0.136565,0.015414,0.262394,0.239468,0.494832,0.026691,0.051061,0.093357,0.100570,...,0.468791,0.217258,0.463345,0.137399,0.108356,0.089524,0.093357,0.021796,0.026691,0.040752
min,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2115.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4202.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6310.000000,0.000000,0.000000,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8416.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [64]:
df['X0'].value_counts()

ak    432
y     348
z     335
x     302
ay    299
t     293
o     246
f     213
w     198
j     171
n     167
aj    162
az    161
s     116
ap    108
al     88
h      64
d      61
e      48
v      40
ai     38
m      34
af     34
am     28
i      25
at     21
u      20
ba     19
a      18
b      13
ad     12
k      12
aw     11
aq     11
r      10
ax      8
as      6
l       6
c       6
bc      6
ao      5
au      5
g       3
p       1
ag      1
an      1
av      1
ae      1
bb      1
Name: X0, dtype: int64

## CSV

In [69]:
from io import StringIO,BytesIO

In [74]:
Data=('column1,column2,column3,column4,column5\n'
'r0,1,2,3,4,5\n'
'r1,6,7,8,9,10\n'
'r2,2,3,4,5,6\n'
'r3,4,5,6,7,8\n')

In [75]:
type('Data')

str

In [76]:
pd.read_csv(StringIO(Data))

    column1  column2  column3  column4  column5
r0        1        2        3        4        5
r1        6        7        8        9       10
r2        2        3        4        5        6
r3        4        5        6        7        8

In [78]:
df=pd.read_csv(StringIO(Data),usecols=['column1','column4'])

In [79]:
df.to_csv('jupyterCSV')

In [86]:
Data=('a,b,c,d\n'
     '1,2,3,4\n'
     '5,6,7,8\n'
      '9,10,11,12\n')

print(Data)

In [87]:
df1=pd.read_csv(StringIO(Data),dtype=int)

In [88]:
df1

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [89]:
df1['a']

0    1
1    5
2    9
Name: a, dtype: int32

In [91]:
df1['a'][1]

5

In [94]:
df1=pd.read_csv(StringIO(Data),dtype={'a':int,'b':'float','c':str})

In [101]:
df1

   a     b   c   d
0  1   2.0   3   4
1  5   6.0   7   8
2  9  10.0  11  12

In [103]:
type(df1['b'][2])

numpy.float64

In [106]:
df1['b']

0     2.0
1     6.0
2    10.0
Name: b, dtype: float64

### Providing Index Column to Data

In [4]:
import pandas as pd
import numpy as np
from io import StringIO,BytesIO

In [50]:
Data1=('a,b,c\n'
      '4,apple,cat\n'
      '5,mango,dog\n'
      '6,chiku,rat')

In [51]:
print(Data1)

a,b,c
4,apple,cat
5,mango,dog
6,chiku,rat

In [52]:
df2=pd.read_csv(StringIO(Data1),dtype={'a':int,'b':str,'c':str})

In [54]:
df2

   a      b    c
0  4  apple  cat
1  5  mango  dog
2  6  chiku  rat

In [55]:
df3=pd.read_csv(StringIO(Data1))

In [56]:
print(df3)

   a      b    c
0  4  apple  cat
1  5  mango  dog
2  6  chiku  rat

In [8]:
Data2=('a,b,c\n'
      '4,apple,cat\n'
      '5,mango,dog\n'
      '6,chiku,rat\n'
      '7,peru,parrot')

In [9]:
print(Data2)

a,b,c
4,apple,cat
5,mango,dog
6,chiku,rat
7,peru,parrot

In [10]:
df4=pd.read_csv(StringIO(Data2))
print(df4)

   a      b       c
0  4  apple     cat
1  5  mango     dog
2  6  chiku     rat
3  7   peru  parrot

In [11]:
df4=pd.read_csv(StringIO(Data2),usecols=['b','c']) #displayes only column b & c along with index column
print(df4)

       b       c
0  apple     cat
1  mango     dog
2  chiku     rat
3   peru  parrot

In [13]:
df4=pd.read_csv(StringIO(Data2),usecols=['b','c'],index_col='c') # uses column 'C' As an index(1st) column)
print(df4)

            b
c
cat     apple
dog     mango
rat     chiku
parrot   peru

### Quoting and Escape Charecters,Usefull for NLP

In [15]:
Data='a,b\n"hello,\\"bob\\",nice to see you",6'

In [16]:
df5=pd.read_csv(StringIO(Data),escapechar='\\')

In [17]:
df5

                             a  b
0  hello,"bob",nice to see you  6

### URL To CSV

In [19]:
df6=pd.read_csv('https://www.myonlinetraininghub.com/excel-tabular-data-format',SEP='/t')

TypeError: parser_f() got an unexpected keyword argument 'SEP'